{
    "internationalizations": [
        {
            "language": "en",
            "description": "My path as a <i>programmer</i> has started at nineish years old, when I've fallen in love with <i>Logo</i>, an educational programming language used to captivate kids in the wonderful lands of <i>Programming</i>. I used to spend hours in a row trying to build figures and animations, using math and geometry. At that time, I just did not know the exciting challenges that were yet to come.<br><br>A few years later, I got an internship as a <i>Webmaster</i>, since then, I have never stopped. It has been more than a decade, where I'm having the chance to work with marvelous people, learning every day, traveling the world, and mainly, always making great friendships.<br><br>I had an entrepreneurship experience, when a friend of mine presented me <i>Magento</i>, an extremely popular e-commerce framework. After doing several courses and a lot of practice, I got contracts with agencies from São Paulo and Rio de Janeiro, Brazil. This entrepreneurship experience gave me the chance to see the other side of the coin, which contributed to sort of expand a bit more my consciousness as an employee.<br><br>Nowadays, I keep seeking new skills, learning and sharing my humble knowledge as much as possible."
        },{
            "language": "fr",
            "description": "Mon parcours de <i>programmeur</i> a commencé vers l'âge de neuf ans, quand je suis tombé amoureux de <i>Logo</i>, un langage de programmation éducatif utilisé pour captiver les enfants dans le monde merveilleux de la <i>Programmation</i>. Je passais des heures à essayer de créer des figures et des animations, en utilisant les mathématiques et la géométrie. À cette époque, je ne connaissais pas encore les défis passionnants qui m'attendaient.<br><br>Quelques années plus tard, j'ai obtenu un stage en tant que <i>Webmaster</i>, et depuis, je n'ai jamais arrêté. Cela fait plus d'une décennie que j'ai la chance de travailler avec des personnes merveilleuses, d'apprendre chaque jour, de voyager à travers le monde et surtout, de toujours nouer de belles amitiés.<br><br>J'ai eu une expérience entrepreneuriale lorsqu'un ami m'a présenté <i>Magento</i>, un framework e-commerce extrêmement populaire. Après avoir suivi plusieurs formations et beaucoup pratiqué, j'ai obtenu des contrats avec des agences de São Paulo et Rio de Janeiro, au Brésil. Cette expérience entrepreneuriale m'a donné l'occasion de voir l'autre côté de la médaille, ce qui a contribué à élargir ma conscience en tant qu'employé.<br><br>Aujourd'hui, je continue à rechercher de nouvelles compétences, à apprendre et à partager mon humble savoir autant que possible."
        }
    ],
    "medias": [        
        {
            "icon": "linkedin",
            "title": "LinkedIn",
            "http": "https://www.linkedin.com/in/mohamed-ali-boudich/"
        },
        {
            "icon": "github",
            "title": "GitHub",
            "http": "https://github.com/allalaspace/"
        },
        {
            "icon": "facebook",
            "title": "Facebook",
            "http": "https://www.facebook.com/mohamedali.boudich/"
        }
    ],
    "hobbies": [        
        {
            "icon": "biking",
            "title": "Cyclisme"
        },
        {
            "icon": "dumbbell",
            "title": "Musculation"
        },
        {
            "icon": "suitcase-rolling",
            "title": "Voyage"
        },
        {
            "icon": "book",
            "title": "Lecture"
        }
    ]
}